existing-jmeter.yaml
execution:
- concurrency: 5
  ramp-up: 1m
  hold-for: 3m
  scenario: simple

scenarios:
  simple:
    script: simple-travel-agency.jmx
    data-sources:
    - path: flights.csv

reporting:
- module: console
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: load-test-results.xml
  dump-csv: load-test-results.csv